// namespace: components/modals/BegModal.tsx
export default {
  'begModal.sorryToDisturb': 'Извините за беспокойство, но...',
  'begModal.weNeedYourHelp': 'Нам нужна ваша помощь!',
  'begModal.cantAffordIt': 'Не можете себе этого позволить?',
  'begModal.shareExercism':
    'Если вы не можете позволить себе пожертвование, но хотели бы помочь как-то иначе, расскажите об Exercism своим друзьям и коллегам и напишите о нас в социальных сетях. Чем больше людей нас использует, тем больше пожертвований мы получаем!',
  'begModal.wantToKnowMore': 'Хотите узнать больше?',
  'begModal.explainsWhyWeNeedDonations':
    'Я подготовил короткое видео, которое объясняет, зачем нам нужны пожертвования и как мы их используем 👇',
  'begModal.fewerThan1Percent':
    'Менее 1% тех, кто пользуется Exercism, решают сделать пожертвование. Если вы можете себе это позволить, пожалуйста, станьте одним из них.',
  'begModal.continueWithoutDonating': 'Продолжить без пожертвования',
  'begModal.previousDonorContent.thankYou':
    'Вы один из немногих людей, кто сделал пожертвование Exercism. Огромное спасибо за вашу поддержку 💙',
  'begModal.previousDonorContent.hateToAskAgain':
    'Мне не хочется просить вас снова (😔), но нам действительно нужна ваша поддержка. Exercism не покрывает свои расходы, и нам очень нужна ваша помощь. Если вам нравится Exercism и вы можете себе это позволить, <0>пожалуйста, подумайте о том, чтобы пожертвовать ещё несколько долларов</0> в нашу поддержку.',
  'begModal.previousDonorContent.monthlyDonationHelpful':
    'Если возможно, ежемесячное пожертвование было бы особенно полезно! Его настройка занимает 30 секунд с помощью формы справа 👉',
  'begModal.nonDonorContent.exercismReliesOnDonations':
    'Exercism существует за счёт пожертвований. Но прямо сейчас нам их не хватает 😔',
  'begModal.nonDonorContent.mostPeopleCantAfford':
    'Большинство людей, пользующихся Exercism, не могут позволить себе пожертвование. Но если вы можете и находите Exercism полезным, <0>пожалуйста, подумайте о том, чтобы пожертвовать несколько долларов</0>, чтобы мы могли сохранить его бесплатным для тех, кто не может себе этого позволить.',
  'begModal.nonDonorContent.only1Percent':
    'Если бы всего 1% наших пользователей регулярно нас поддерживал, мы смогли бы покрыть свои расходы. Пожертвование занимает 30 секунд с помощью формы справа 👉',
}
